/* automatically generated by rust-bindgen 0.63.0 */

pub const RP_MODEL: &[u8; 4usize] = b"Z10\0";
pub const ADC_SAMPLE_RATE: f64 = 125000000.0;
pub const ADC_BITS: u32 = 14;
pub const ADC_REG_BITS: u32 = 14;
pub const ADC_BITS_MASK: u32 = 16383;
pub const ADC_REG_BITS_MASK: u32 = 16383;
pub const DAC_FREQUENCY: f64 = 125000000.0;
pub const ADC_BUFFER_SIZE: u32 = 16384;
pub const BUFFER_LENGTH: u32 = 16384;
pub const RP_OK: u32 = 0;
pub const RP_EOED: u32 = 1;
pub const RP_EOMD: u32 = 2;
pub const RP_ECMD: u32 = 3;
pub const RP_EMMD: u32 = 4;
pub const RP_EUMD: u32 = 5;
pub const RP_EOOR: u32 = 6;
pub const RP_ELID: u32 = 7;
pub const RP_EMRO: u32 = 8;
pub const RP_EWIP: u32 = 9;
pub const RP_EPN: u32 = 10;
pub const RP_UIA: u32 = 11;
pub const RP_FCA: u32 = 12;
pub const RP_RCA: u32 = 13;
pub const RP_BTS: u32 = 14;
pub const RP_EIPV: u32 = 15;
pub const RP_EUF: u32 = 16;
pub const RP_ENN: u32 = 17;
pub const RP_EFOB: u32 = 18;
pub const RP_EFCB: u32 = 19;
pub const RP_EABA: u32 = 20;
pub const RP_EFRB: u32 = 21;
pub const RP_EFWB: u32 = 22;
pub const RP_EMNC: u32 = 23;
pub const RP_NOTS: u32 = 24;
pub const SPECTR_OUT_SIG_LEN: u32 = 2048;
#[doc = "!< LED 0"]
pub const rp_dpin_t_RP_LED0: rp_dpin_t = 0;
#[doc = "!< LED 1"]
pub const rp_dpin_t_RP_LED1: rp_dpin_t = 1;
#[doc = "!< LED 2"]
pub const rp_dpin_t_RP_LED2: rp_dpin_t = 2;
#[doc = "!< LED 3"]
pub const rp_dpin_t_RP_LED3: rp_dpin_t = 3;
#[doc = "!< LED 4"]
pub const rp_dpin_t_RP_LED4: rp_dpin_t = 4;
#[doc = "!< LED 5"]

    #[doc = "!< High gain front end full scale voltage, channel B"]
    pub fe_ch2_fs_g_hi: u32,
    #[doc = "!< Low gain front end full scale voltage, channel A"]
    pub fe_ch1_fs_g_lo: u32,
    #[doc = "!< Low gain front end full scale voltage, channel B"]
    pub fe_ch2_fs_g_lo: u32,
    #[doc = "!< Front end DC offset, channel A"]
    pub fe_ch1_lo_offs: i32,
    #[doc = "!< Front end DC offset, channel B"]
    pub fe_ch2_lo_offs: i32,
    #[doc = "!< Back end full scale voltage, channel A"]
    pub be_ch1_fs: u32,
    #[doc = "!< Back end full scale voltage, channel B"]
    pub be_ch2_fs: u32,
    #[doc = "!< Back end DC offset, channel A"]
    pub be_ch1_dc_offs: i32,
    #[doc = "!< Back end DC offset, on channel B"]
    pub be_ch2_dc_offs: i32,
    pub magic: u32,
    #[doc = "!< Front end DC offset, channel A"]
    pub fe_ch1_hi_offs: i32,
    #[doc = "!< Front end DC offset, channel B"]
    pub fe_ch2_hi_offs: i32,
    #[doc = "!< Filter equalization coefficients AA for Low\n!< mode, channel A"]
    pub low_filter_aa_ch1: u32,
    #[doc = "!< Filter equalization coefficients BB for Low\n!< mode, channel A"]
    pub low_filter_bb_ch1: u32,
    #[doc = "!< Filter equalization coefficients PP for Low\n!< mode, channel A"]
    pub low_filter_pp_ch1: u32,
    #[doc = "!< Filter equalization coefficients KK for Low\n!< mode, channel A"]
    pub low_filter_kk_ch1: u32,
    #[doc = "!< Filter equalization coefficients AA for Low\n!< mode, channel B"]
    pub low_filter_aa_ch2: u32,
    #[doc = "!< Filter equalization coefficients BB for Low\n!< mode, channel B"]
    pub low_filter_bb_ch2: u32,
    #[doc = "!< Filter equalization coefficients PP for Low\n!< mode, channel B"]
    pub low_filter_pp_ch2: u32,
    #[doc = "!< Filter equalization coefficients KK for Low\n!< mode, channel B"]
    pub low_filter_kk_ch2: u32,
    #[doc = "!< Filter equalization coefficients AA for High\n!< mode, channel A"]
    pub hi_filter_aa_ch1: u32,
    #[doc = "!< Filter equalization coefficients BB for High\n!< mode, channel A"]
    pub hi_filter_bb_ch1: u32,
    #[doc = "!< Filter equalization coefficients PP for High\n!< mode, channel A"]
    pub hi_filter_pp_ch1: u32,
    #[doc = "!< Filter equalization coefficients KK for High\n!< mode, channel A"]
    pub hi_filter_kk_ch1: u32,
    #[doc = "!< Filter equalization coefficients AA for High\n!< mode, channel B"]
    pub hi_filter_aa_ch2: u32,
    #[doc = "!< Filter equalization coefficients BB for High\n!< mode, channel B"]
    pub hi_filter_bb_ch2: u32,
    #[doc = "!< Filter equalization coefficients PP for High\n!< mode, channel B"]
    pub hi_filter_pp_ch2: u32,
    #[doc = "!< Filter equalization coefficients KK for High\n!< mode, channel B"]
    pub hi_filter_kk_ch2: u32,
}
#[test]
fn bindgen_test_layout_rp_calib_params_t() {
    const UNINIT: ::std::mem::MaybeUninit<rp_calib_params_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rp_calib_params_t>(),
        116usize,
        concat!("Size of: ", stringify!(rp_calib_params_t))
    );
    assert_eq!(
        ::std::mem::align_of::<rp_calib_params_t>(),
        4usize,
        concat!("Alignment of ", stringify!(rp_calib_params_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fe_ch1_fs_g_hi) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rp_calib_params_t),
            "::",
            stringify!(fe_ch1_fs_g_hi)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fe_ch2_fs_g_hi) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rp_calib_params_t),
            "::",
            stringify!(fe_ch2_fs_g_hi)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fe_ch1_fs_g_lo) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rp_calib_params_t),
            "::",
            stringify!(fe_ch1_fs_g_lo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fe_ch2_fs_g_lo) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rp_calib_params_t),
            "::",
            stringify!(fe_ch2_fs_g_lo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fe_ch1_lo_offs) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rp_calib_params_t),
            "::",
            stringify!(fe_ch1_lo_offs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fe_ch2_lo_offs) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(rp_calib_params_t),
            "::",
            stringify!(fe_ch2_lo_offs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).be_ch1_fs) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(rp_calib_params_t),
            "::",
            stringify!(be_ch1_fs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).be_ch2_fs) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(rp_calib_params_t),
            "::",
            stringify!(be_ch2_fs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).be_ch1_dc_offs) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(rp_calib_params_t),
            "::",
            stringify!(be_ch1_dc_offs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).be_ch2_dc_offs) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(rp_calib_params_t),
            "::",
            stringify!(be_ch2_dc_offs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).magic) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(rp_calib_params_t),
            "::",
            stringify!(magic)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fe_ch1_hi_offs) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(rp_calib_params_t),
            "::",
            stringify!(fe_ch1_hi_offs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fe_ch2_hi_offs) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(rp_calib_params_t),
            "::",
            stringify!(fe_ch2_hi_offs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).low_filter_aa_ch1) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(rp_calib_params_t),
            "::",
            stringify!(low_filter_aa_ch1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).low_filter_bb_ch1) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(rp_calib_params_t),
            "::",
            stringify!(low_filter_bb_ch1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).low_filter_pp_ch1) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(rp_calib_params_t),
            "::",
            stringify!(low_filter_pp_ch1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).low_filter_kk_ch1) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(rp_calib_params_t),
            "::",
            stringify!(low_filter_kk_ch1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).low_filter_aa_ch2) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(rp_calib_params_t),
            "::",
            stringify!(low_filter_aa_ch2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).low_filter_bb_ch2) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(rp_calib_params_t),
            "::",
            stringify!(low_filter_bb_ch2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).low_filter_pp_ch2) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(rp_calib_params_t),
            "::",
            stringify!(low_filter_pp_ch2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).low_filter_kk_ch2) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(rp_calib_params_t),
            "::",
            stringify!(low_filter_kk_ch2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hi_filter_aa_ch1) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(rp_calib_params_t),
            "::",
            stringify!(hi_filter_aa_ch1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hi_filter_bb_ch1) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(rp_calib_params_t),
            "::",
            stringify!(hi_filter_bb_ch1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hi_filter_pp_ch1) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(rp_calib_params_t),
            "::",
            stringify!(hi_filter_pp_ch1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hi_filter_kk_ch1) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(rp_calib_params_t),
            "::",
            stringify!(hi_filter_kk_ch1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hi_filter_aa_ch2) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(rp_calib_params_t),
            "::",
            stringify!(hi_filter_aa_ch2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hi_filter_bb_ch2) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(rp_calib_params_t),
            "::",
            stringify!(hi_filter_bb_ch2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hi_filter_pp_ch2) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(rp_calib_params_t),
            "::",
            stringify!(hi_filter_pp_ch2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hi_filter_kk_ch2) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(rp_calib_params_t),
            "::",
            stringify!(hi_filter_kk_ch2)
        )
    );
}
extern "C" {
    #[doc = " Initializes the library. It must be called first, before any other library\n method.\n @return If the function is successful, the return value is RP_OK.\n If the function is unsuccessful, the return value is any of RP_E* values that\n indicate an error."]
    pub fn rp_Init() -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Initializes the library. It must be called first, before any other library\n method.\n @param reset Reset to default configuration on api\n @return If the function is successful, the return value is RP_OK.\n If the function is unsuccessful, the return value is any of RP_E* values that\n indicate an error."]
    pub fn rp_InitReset(reset: bool) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rp_IsApiInit() -> ::std::os::raw::c_int;
}
extern "C" {
